In [74]:
import pandas as pd
import os
school_data_to_load = "Resources/schools_complete.csv"
school_data_df = pd.read_csv(school_data_to_load)
student_data_to_load = "Resources/students_complete.csv"
student_data_df = pd.read_csv(student_data_to_load)

student_data_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [75]:
prefixes_suffixes = ["Dr. ","Mr. ", "Mrs.", "Miss ", " MD"," DDS", " DVM", " PhD"]
for word in prefixes_suffixes:
    student_data_df["student_name"] = student_data_df["student_name"].str.replace(word, "")
student_data_df

<ipython-input-75-abdf3a7b1bd7>:3: FutureWarning: The default value of regex will change from True to False in a future version.
  student_data_df["student_name"] = student_data_df["student_name"].str.replace(word, "")

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84
...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75

In [105]:
# combine the data into a single dataset

school_data_complete_df = pd.merge(student_data_df, school_data_df, on=["school_name", "school_name"])
school_data_complete_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [121]:
# get the total number of the student
student_count = school_data_complete_df["Student ID"].count()
student_count

39170

In [122]:
school_count_2 = school_data_complete_df["school_name"].unique()
school_count_2

array(['Huang High School', 'Figueroa High School', 'Shelton High School',
       'Hernandez High School', 'Griffin High School',
       'Wilson High School', 'Cabrera High School', 'Bailey High School',
       'Holden High School', 'Pena High School', 'Wright High School',
       'Rodriguez High School', 'Johnson High School', 'Ford High School',
       'Thomas High School'], dtype=object)

In [123]:
a = len(school_count_2)
a

15

In [124]:
# calculate the budget
total_budget = school_data_df["budget"].sum()
total_budget

24649428

In [125]:
# calculate the average reading score and math score
average_reading_score = school_data_complete_df["reading_score"].mean()
average_math_score = school_data_complete_df["math_score"].mean()
print(average_reading_score, average_math_score)

81.87784018381414 78.98537145774827

In [126]:
#get the passing percentage
passing_math = school_data_complete_df["math_score"] >=70
passing_reading = school_data_complete_df["reading_score"] >=70
passing_math

0         True
1        False
2        False
3        False
4         True
         ...
39165     True
39166     True
39167     True
39168     True
39169     True
Name: math_score, Length: 39170, dtype: bool

In [127]:
#get all the students who are passing math in a new DataFrame
passing_math = school_data_complete_df[school_data_complete_df["math_score"]>=70]
passing_math.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635

In [128]:
passing_reading = school_data_complete_df[school_data_complete_df["reading_score"]>=70]

In [129]:
# calculate the number of students passing math and reading respectively
pass_math_count = passing_math["student_name"].count()
pass_reading_count = passing_reading["student_name"].count()
print(pass_math_count)
print(pass_reading_count)

29370
33610

In [130]:
#calculate the percent that passed math and reading

pass_math_percentage = pass_math_count / 39170 * 100
pass_reading_percentage = pass_reading_count / 39170 * 100
pass_math_percentage

74.9808526933878

In [131]:
# calculate the students who are passing both math and reading
passing_math_reading = school_data_complete_df[(school_data_complete_df["reading_score"]>=70) & (school_data_complete_df["math_score"]>=70)]
passing_math_reading.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635
9,9,Matthew Greene,M,10th,Huang High School,96,84,0,District,2917,1910635

In [132]:
pass_math_reading_count=passing_math_reading["student_name"].count()
pass_math_reading_percentage = pass_math_reading_count / 39170 * 100
pass_math_reading_percentage

65.17232575950983

In [145]:
# adding a list of values with keys to create a new dataframe
district_summary_df = pd.DataFrame([{
    "Total Schools": a,
    "Total Students":student_count,
    "Total Budget": total_budget,
    "Average Math Score":average_math_score,
    "Average Reading Score":average_reading_score,    
    "% Passing Math Percentage":pass_math_percentage,
    "% Passing Reading Percentage":pass_reading_percentage,
    "% Passing Math & Reading Percentage":pass_math_reading_percentage}])
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math Percentage,% Passing Reading Percentage,% Passing Math & Reading Percentage
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,65.172326

In [146]:
# Format the "Total student" to have the comma for a thousand separator
district_summary_df["Total Students"] = district_summary_df["Total Students"].map("{:,}".format)
district_summary_df["Total Students"]

0    39,170
Name: Total Students, dtype: object

In [147]:
# Format the budget to have the comma for a thousands separator, a decimal and a dollar sign
district_summary_df["Total Budget"] = district_summary_df["Total Budget"].map("${:,.2f}".format)
district_summary_df["Total Budget"]

0    $24,649,428.00
Name: Total Budget, dtype: object

In [148]:
district_summary_df["Average Math Score"] = district_summary_df["Average Math Score"].map("{:.1f}".format)
district_summary_df["Average Reading Score"] = district_summary_df["Average Reading Score"].map("{:.1f}".format)
district_summary_df["% Passing Math Percentage"] = district_summary_df["% Passing Math Percentage"].map("{:.0f}".format)
district_summary_df["% Passing Reading Percentage"] = district_summary_df["% Passing Reading Percentage"].map("{:.0f}".format)
district_summary_df["% Passing Math & Reading Percentage"] = district_summary_df["% Passing Math & Reading Percentage"].map("{:.0f}".format)

district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math Percentage,% Passing Reading Percentage,% Passing Math & Reading Percentage
0,15,"39,170","$24,649,428.00",79.0,81.9,75,86,65

In [153]:
new_order = ["Total Schools","Total Students","Total Budget","Average Math Score","Average Reading Score", "% Passing Math Percentage","% Passing Reading Percentage","% Passing Math & Reading Percentage"]
district_summary_df = district_summary_df[new_order]
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math Percentage,% Passing Reading Percentage,% Passing Math & Reading Percentage
0,15,"39,170","$24,649,428.00",79.0,81.9,75,86,65